Repository: taigikeyboard/taigikeyboard
Catalog: ios/Localizable.xcstrings
Source language: nan_hant_tw
Languages: en, ja, nan_latn_tw_x_poj, nan_latn_tw_x_tailo

# i18n_settings_tpsOrMapsToERInfo
source: 控制方音符號候選詞按怎顯示 or。開啟時顯示做 ㄜ，關閉時顯示做 ㄛ。這个設定袂影響揣詞結果。
en: Controls how TPS candidates display 'or'. When on, 'or' appears as ㄜ; when off, it appears as ㄛ. This setting does not affect search results.
ja: 方音符号の候補で「or」をどう表示するかを設定します。オンでは ㄜ、オフでは ㄛ と表示します。検索結果には影響しません。
nan_latn_tw_x_poj: khòng-chè hong-im-hû-hō hāu-soán sû án-nóa hián-sī or. phah-khui sî hián-sī chò ㄜ, koaiⁿ--khí-lâi sî hián-sī chò ㄛ. chit ê siat-tēng bōe éng-hióng chhōe sû kiat-kó.
nan_latn_tw_x_tailo: khòng-tsè hong-im-hû-hō hāu-suán sû án-nuá hián-sī or. phah-khui sî hián-sī tsò ㄜ, kuainn--khí-lâi sî hián-sī tsò ㄛ. tsit ê siat-tīng buē íng-hióng tshuē sû kiat-kó.

# i18n_settings_tpsSettingsSectionTitle
source: 方音符號
en: Phonetic Symbols
ja: 方音符号
nan_latn_tw_x_poj: hong-im-hû-hō
nan_latn_tw_x_tailo: hong-im-hû-hō

# i18n_settings_typingSectionTitle
source: 拍字設定
en: Typing
ja: 入力
nan_latn_tw_x_poj: phah-jī siat-tēng
nan_latn_tw_x_tailo: phah-jī siat-tīng

# i18n_settings_vibrationFeedback
source: 震動反應
en: Vibration
ja: バイブレーション
nan_latn_tw_x_poj: tín-tāng hoán-èng
nan_latn_tw_x_tailo: tín-tāng huán-ìng

# i18n_symbol_fullWidth
source: 全形
en: Full-width
ja: 全角
nan_latn_tw_x_poj: choân-hêng
nan_latn_tw_x_tailo: tsuân-hîng

# i18n_symbol_halfWidth
source: 半形
en: Half-width
ja: 半角
nan_latn_tw_x_poj: pòaⁿ-hêng
nan_latn_tw_x_tailo: puànn-hîng

# i18n_symbol_hiragana
source: 平假名
en: Hiragana
ja: ひらがな
nan_latn_tw_x_poj: pêng-ké-miâ
nan_latn_tw_x_tailo: pîng-ké-miâ

# i18n_symbol_kaomoji
source: 顏文字
en: Kaomoji
ja: 顔文字
nan_latn_tw_x_poj: gân-bûn-jī
nan_latn_tw_x_tailo: gân-bûn-jī

# i18n_symbol_katakana
source: 片假名
en: Katakana
ja: カタカナ
nan_latn_tw_x_poj: phiàn-ké-miâ
nan_latn_tw_x_tailo: phiàn-ké-miâ

# i18n_theme_candidateSection
source: 候選詞介面
en: Candidate Bar
ja: 候補バー
nan_latn_tw_x_poj: hāu-soán sû kài-bīn
nan_latn_tw_x_tailo: hāu-suán sû kài-bīn

# i18n_theme_candidateTextSize
source: 候選詞大細
en: Candidate Text Size
ja: 候補の文字の大きさ
nan_latn_tw_x_poj: hāu-soán sû tōa-sè
nan_latn_tw_x_tailo: hāu-suán sû tuā-sè

# i18n_theme_capReachedMessage
source: 自訂主題上限是 5 个，請先刪除一个才會使閣新增。
en: You can save up to 5 custom themes. Delete one before adding another.
ja: カスタムテーマは 5 個まで保存できます。追加する前に 1 個削除してください。
nan_latn_tw_x_poj: chū-tēng chú-tê siōng hān sī 5 ê, chhiáⁿ sian san-tî chi̍t-ê chiah ē-sái koh sin-cheng.
nan_latn_tw_x_tailo: tsū-tīng tsú-tê siōng hān sī 5 ê, tshiánn sian san-tî tsi̍t-ê tsiah ē-sái koh sin-tsing.

# i18n_theme_capReachedTitle
source: 已達主題數量上限
en: Theme Limit Reached
ja: テーマ数の上限に達しました
nan_latn_tw_x_poj: í ta̍t chú-tê sò͘-liōng siōng hān
nan_latn_tw_x_tailo: í ta̍t tsú-tê sòo-liōng siōng hān

# i18n_theme_cardMenuApply
source: 套用
en: Apply
ja: 適用
nan_latn_tw_x_poj: thò-iōng
nan_latn_tw_x_tailo: thò-iōng

# i18n_theme_cardMenuEdit
source: 編輯
en: Edit
ja: 編集
nan_latn_tw_x_poj: pian-chi̍p
nan_latn_tw_x_tailo: pian-tsi̍p

# i18n_theme_colorCandidateBackground
source: 候選詞背景
en: Candidate Background
ja: 候補の背景
nan_latn_tw_x_poj: hāu-soán sû pōe-kéng
nan_latn_tw_x_tailo: hāu-suán sû puē-kíng

# i18n_theme_colorCandidateText
source: 候選詞文字
en: Candidate Text
ja: 候補の文字
nan_latn_tw_x_poj: hāu-soán sû bûn-jī
nan_latn_tw_x_tailo: hāu-suán sû bûn-jī

# i18n_theme_colorKeySection
source: 揤鈕介面
en: Keys
ja: キー
nan_latn_tw_x_poj: chhi̍h-liú kài-bīn
nan_latn_tw_x_tailo: tshi̍h-liú kài-bīn

# i18n_theme_colorKeyText
source: 揤鈕文字
en: Key Text
ja: キー文字
nan_latn_tw_x_poj: chhi̍h-liú bûn-jī
nan_latn_tw_x_tailo: tshi̍h-liú bûn-jī

# i18n_theme_colorKeyboardBackground
source: 齒盤色水
en: Keyboard Background
ja: キーボード背景
nan_latn_tw_x_poj: khí-pôaⁿ sek-chúi
nan_latn_tw_x_tailo: khí-puânn sik-tsuí

# i18n_theme_colorNormalKeyFill
source: 一般揤鈕色水
en: Normal Key Fill
ja: 通常キーの色
nan_latn_tw_x_poj: it-poaⁿ chhi̍h-liú sek-chúi
nan_latn_tw_x_tailo: it-puann tshi̍h-liú sik-tsuí

# i18n_theme_colorSpecialKeyFill
source: 特殊揤鈕色水
en: Special Key Fill
ja: 特殊キーの色
nan_latn_tw_x_poj: te̍k-sû chhi̍h-liú sek-chúi
nan_latn_tw_x_tailo: ti̍k-sû tshi̍h-liú sik-tsuí

# i18n_theme_createNewTheme
source: 新主題…
en: New Theme…
ja: 新しいテーマ…
nan_latn_tw_x_poj: sin chú-tê...
nan_latn_tw_x_tailo: sin tsú-tê...

# i18n_theme_customFont
source: 字型設定
en: Font
ja: フォント
nan_latn_tw_x_poj: jī-hêng siat-tēng
nan_latn_tw_x_tailo: jī-hîng siat-tīng

# i18n_theme_customThemesSection
source: 自訂主題
en: Custom Themes
ja: カスタムテーマ
nan_latn_tw_x_poj: chū-tēng chú-tê
nan_latn_tw_x_tailo: tsū-tīng tsú-tê

# i18n_theme_defaultName
source: 新主題
en: New Theme
ja: 新しいテーマ
nan_latn_tw_x_poj: sin chú-tê
nan_latn_tw_x_tailo: sin tsú-tê

# i18n_theme_editorResetAll
source: 恢復預設設定
en: Reset to Defaults
ja: 既定値に戻す
nan_latn_tw_x_poj: hoe-ho̍k ī-siat siat-tēng
nan_latn_tw_x_tailo: hue-ho̍k ī-siat siat-tīng

# i18n_theme_editorSave
source: 儲存
en: Save
ja: 保存
nan_latn_tw_x_poj: thú-chûn
nan_latn_tw_x_tailo: thú-tsûn

# i18n_theme_editorTitleEdit
source: 編輯主題
en: Edit Theme
ja: テーマを編集
nan_latn_tw_x_poj: pian-chi̍p chú-tê
nan_latn_tw_x_tailo: pian-tsi̍p tsú-tê

# i18n_theme_editorTitleNew
source: 新主題
en: New Theme
ja: 新しいテーマ
nan_latn_tw_x_poj: sin chú-tê
nan_latn_tw_x_tailo: sin tsú-tê

# i18n_theme_familyClassic
source: 填色揤鈕
en: Filled
ja: 塗りつぶし
nan_latn_tw_x_poj: thiam-sek chhi̍h-liú
nan_latn_tw_x_tailo: thiām-sik tshi̍h-liú

# i18n_theme_familyClean
source: 無框揤鈕
en: Borderless
ja: 枠なし
nan_latn_tw_x_poj: bô-kheng chhi̍h-liú
nan_latn_tw_x_tailo: bô-khing tshi̍h-liú

# i18n_theme_familyFramed
source: 框線揤鈕
en: Outlined
ja: 枠線
nan_latn_tw_x_poj: kheng-sòaⁿ chhi̍h-liú
nan_latn_tw_x_tailo: khing-suànn tshi̍h-liú

# i18n_theme_keyBorderWidth
source: 揤鈕邊粗幼
en: Key Border Width
ja: キーの枠線の太さ
nan_latn_tw_x_poj: chhi̍h-liú piⁿ chho͘-iù
nan_latn_tw_x_tailo: tshi̍h-liú pinn tshoo-iù

# i18n_theme_keyCornerRadius
source: 揤鈕圓角
en: Key Corner Radius
ja: キーの角丸
nan_latn_tw_x_poj: chhi̍h-liú îⁿ kak
nan_latn_tw_x_tailo: tshi̍h-liú înn kak

# i18n_theme_keyFontSize
source: 揤鈕字大細
en: Key Font Size
ja: キー文字の大きさ
nan_latn_tw_x_poj: chhi̍h-liú jī tōa-sè
nan_latn_tw_x_tailo: tshi̍h-liú jī tuā-sè

# i18n_theme_keyHeight
source: 齒盤懸度
en: Keyboard Height
ja: キーボードの高さ
nan_latn_tw_x_poj: khí-pôaⁿ koân-tō͘
nan_latn_tw_x_tailo: khí-puânn kuân-tōo

# i18n_theme_keyShadow
source: 揤鈕陰影
en: Key Shadow
ja: キーの影
nan_latn_tw_x_poj: chhi̍h-liú im-iáⁿ
nan_latn_tw_x_tailo: tshi̍h-liú im-iánn

# i18n_theme_keyboardSection
source: 齒盤介面
en: Keyboard Surface
ja: キーボード面
nan_latn_tw_x_poj: khí-pôaⁿ kài-bīn
nan_latn_tw_x_tailo: khí-puânn kài-bīn

# i18n_theme_nameHeader
source: 主題名稱
en: Theme Name
ja: テーマ名
nan_latn_tw_x_poj: chú-tê miâ-chheng
nan_latn_tw_x_tailo: tsú-tê miâ-tshing

# i18n_theme_namePlaceholder
source: 輸入主題名稱
en: Enter a theme name
ja: テーマ名を入力
nan_latn_tw_x_poj: su-ji̍p chú-tê miâ-chheng
nan_latn_tw_x_tailo: su-ji̍p tsú-tê miâ-tshing

# i18n_theme_paletteBlue
source: 海風
en: Sea Breeze
ja: 潮風
nan_latn_tw_x_poj: hái-hong
nan_latn_tw_x_tailo: hái-hong

# i18n_theme_paletteCatppuccin
source: 暗眠山貓
en: Catppuccin
ja: キャットプチン
nan_latn_tw_x_poj: àm-bîn-soaⁿ-niau
nan_latn_tw_x_tailo: àm-bîn-suann-niau

# i18n_theme_paletteDefault
source: 預設
en: Default
ja: デフォルト
nan_latn_tw_x_poj: ī-siat
nan_latn_tw_x_tailo: ī-siat

# i18n_theme_paletteGold
source: 金煌
en: Gold
ja: ゴールド
nan_latn_tw_x_poj: kim-hông
nan_latn_tw_x_tailo: kim-hông

# i18n_theme_paletteGreen
source: 翠青
en: Jade
ja: 翡翠
nan_latn_tw_x_poj: chhùi-chheng
nan_latn_tw_x_tailo: tshuì-tshing

# i18n_theme_palettePink
source: 櫻花
en: Sakura
ja: 桜
nan_latn_tw_x_poj: eng-hoe
nan_latn_tw_x_tailo: ing-hue

# i18n_theme_palettePurple
source: 藤紫
en: Wisteria
nan_latn_tw_x_poj: tîn-chí
nan_latn_tw_x_tailo: tîn-tsí
